{
  "common": {
    "name": "poolcontrol",
    "version": "0.9.0",
    "news": {
       "0.9.0": {
         "en": "New heating / heat pump control (heatHelper). Automatic control based on pool temperature with configurable target and maximum temperature, pump after-run time, and full priority handling (e.g. maintenance mode). Works only in automatic pump mode and respects season status. Supports both switchable sockets and boolean control states. Includes ownership protection to avoid interfering with other pump controllers.",
         "de": "Neue Heizungs- / Wärmepumpensteuerung (heatHelper). Automatische Regelung basierend auf der Pooltemperatur mit konfigurierbarer Ziel- und Maximaltemperatur, Pumpen-Nachlaufzeit sowie vollständiger Vorranglogik (z. B. Wartungsmodus). Arbeitet ausschließlich im Automatikmodus der Pumpe und berücksichtigt den Saisonstatus. Unterstützt schaltbare Steckdosen und boolesche Steuer-States. Enthält Ownership-Schutz, um Konflikte mit anderen Pumpensteuerungen zu vermeiden.",
         "ru": "Новая система управления отоплением / тепловым насосом (heatHelper). Автоматическое управление на основе температуры воды с настраиваемой целевой и максимальной температурой, временем добега насоса и полной системой приоритетов (например, режим обслуживания). Работает только в автоматическом режиме насоса и учитывает сезонный статус. Поддерживает как переключаемые розетки, так и булевы управляющие состояния. Включает защиту владения для предотвращения конфликтов с другими контроллерами насоса.",
         "pt": "Novo controlo de aquecimento / bomba de calor (heatHelper). Controlo automático baseado na temperatura da piscina com temperatura alvo e máxima configuráveis, tempo de pós-funcionamento da bomba e lógica completa de prioridades (por exemplo, modo de manutenção). Funciona apenas no modo automático da bomba e respeita o estado da época. Suporta tomadas comutáveis e estados de controlo booleanos. Inclui proteção de propriedade para evitar conflitos com outros controladores da bomba.",
         "nl": "Nieuwe verwarmings- / warmtepompregeling (heatHelper). Automatische regeling op basis van de zwembadtemperatuur met instelbare doel- en maximumtemperatuur, pomp-nalooptijd en volledige prioriteitslogica (bijv. onderhoudsmodus). Werkt uitsluitend in de automatische pompmodus en houdt rekening met de seizoensstatus. Ondersteunt zowel schakelbare stopcontacten als booleaanse besturingsstates. Bevat eigendomsbescherming om conflicten met andere pompcontrollers te voorkomen.",
         "fr": "Nouveau contrôle de chauffage / pompe à chaleur (heatHelper). Régulation automatique basée sur la température de la piscine avec températures cible et maximale configurables, temps de post-fonctionnement de la pompe et gestion complète des priorités (par ex. mode maintenance). Fonctionne uniquement en mode automatique de la pompe et respecte le statut de saison. Prend en charge les prises commutables et les états de commande booléens. Inclut une protection de propriété afin d’éviter les conflits avec d’autres contrôleurs de pompe.",
         "it": "Nuovo controllo di riscaldamento / pompa di calore (heatHelper). Controllo automatico basato sulla temperatura della piscina con temperatura obiettivo e massima configurabili, tempo di post-funzionamento della pompa e gestione completa delle priorità (ad es. modalità manutenzione). Funziona solo in modalità automatica della pompa e tiene conto dello stato stagionale. Supporta prese commutabili e stati di controllo booleani. Include una protezione di proprietà per evitare conflitti con altri controllori della pompa.",
         "es": "Nuevo control de calefacción / bomba de calor (heatHelper). Control automático basado en la temperatura de la piscina con temperatura objetivo y máxima configurables, tiempo de posfuncionamiento de la bomba y gestión completa de prioridades (p. ej., modo de mantenimiento). Funciona únicamente en modo automático de la bomba y respeta el estado de la temporada. Compatible con enchufes conmutables y estados de control booleanos. Incluye protección de propiedad para evitar conflictos con otros controladores de la bomba.",
         "pl": "Nowy system sterowania ogrzewaniem / pompą ciepła (heatHelper). Automatyczne sterowanie na podstawie temperatury basenu z konfigurowalną temperaturą docelową i maksymalną, czasem dobiegu pompy oraz pełną obsługą priorytetów (np. tryb konserwacji). Działa wyłącznie w trybie automatycznym pompy i uwzględnia status sezonu. Obsługuje przełączalne gniazda oraz binarne stany sterujące. Zawiera ochronę własności, aby zapobiec konfliktom z innymi kontrolerami pompy.",
         "uk": "Нова система керування опаленням / тепловим насосом (heatHelper). Автоматичне керування на основі температури басейну з налаштовуваною цільовою та максимальною температурою, часом післяроботи насоса та повною системою пріоритетів (наприклад, режим обслуговування). Працює лише в автоматичному режимі насоса та враховує сезонний статус. Підтримує комутовані розетки та булеві стани керування. Містить захист володіння для запобігання конфліктам з іншими контролерами насоса.",
         "zh-cn": "新增加热 / 热泵控制功能（heatHelper）。基于泳池水温的自动控制，支持可配置的目标温度和最高温度、泵后运行时间以及完整的优先级处理（例如维护模式）。仅在泵的自动模式下工作，并考虑季节状态。支持可开关插座和布尔控制状态。包含所有权保护机制，避免与其他泵控制逻辑发生冲突。"
       },
       "0.8.2": {
         "en": "New AI chemistry help module. Provides an interactive, purely informational help system for common pool water issues (e.g. pH too high/low, chlorine ineffective, green or cloudy water). Generates understandable explanations and solution directions without automatic dosing, product recommendations, device control or speech output.",
         "de": "Neues KI-Chemie-Hilfesystem. Bietet eine interaktive, rein informative Unterstützung bei typischen Poolwasserproblemen (z. B. pH zu hoch/niedrig, Chlor wirkt nicht, grünes oder trübes Wasser). Erzeugt verständliche Ursachen- und Lösungshinweise ohne automatische Dosierung, Produktempfehlungen, Geräte­steuerung oder Sprachausgabe.",
         "ru": "Новый модуль помощи по химии бассейна на основе ИИ. Интерактивная, исключительно информационная система поддержки для типичных проблем воды (например, высокий/низкий pH, неэффективный хлор, зелёная или мутная вода). Без автоматического дозирования, рекомендаций продуктов, управления устройствами или голосового вывода.",
         "pt": "Novo módulo de ajuda química com IA. Sistema interativo e puramente informativo para problemas comuns da água da piscina (por exemplo, pH alto/baixo, cloro ineficaz, água verde ou turva). Sem dosagem automática, recomendações de produtos, controlo de dispositivos ou saída de voz.",
         "nl": "Nieuw AI-chemiehulpmodule. Biedt een interactieve, puur informatieve hulp voor veelvoorkomende zwembadwaterproblemen (bijv. pH te hoog/laag, chloor werkt niet, groen of troebel water). Geen automatische dosering, productaanbevelingen, apparaatbesturing of spraakuitvoer.",
         "fr": "Nouveau module d’aide chimique basé sur l’IA. Système interactif et purement informatif pour les problèmes courants de l’eau de piscine (pH trop élevé/bas, chlore inefficace, eau verte ou trouble). Sans dosage automatique, recommandations de produits, contrôle d’appareils ni sortie vocale.",
         "it": "Nuovo modulo di aiuto chimico basato su IA. Sistema interattivo e puramente informativo per i problemi comuni dell’acqua della piscina (ad es. pH troppo alto/basso, cloro inefficace, acqua verde o torbida). Nessun dosaggio automatico, consigli sui prodotti, controllo dei dispositivi o output vocale.",
         "es": "Nuevo módulo de ayuda química con IA. Sistema interactivo y puramente informativo para problemas comunes del agua de la piscina (p. ej., pH alto/bajo, cloro ineficaz, agua verde o turbia). Sin dosificación automática, recomendaciones de productos, control de dispositivos ni salida por voz.",
         "pl": "Nowy moduł pomocy chemicznej oparty na AI. Interaktywny, wyłącznie informacyjny system wsparcia dla typowych problemów wody basenowej (np. zbyt wysokie/niskie pH, nieskuteczny chlor, zielona lub mętna woda). Bez automatycznego dozowania, rekomendacji produktów, sterowania urządzeniami ani komunikatów głosowych.",
         "uk": "Новий модуль допомоги з хімії басейну на основі ШІ. Інтерактивна, виключно інформаційна система підтримки для типових проблем води (наприклад, високий/низький pH, неефективний хлор, зелена або каламутна вода). Без автоматичного дозування, рекомендацій продуктів, керування пристроями чи голосового виводу.",
         "zh-cn": "新增 AI 水质化学帮助模块。为常见的泳池水问题（如 pH 过高/过低、氯无效、绿水或浑浊水）提供交互式、纯信息性的帮助说明。不包含自动投加、产品推荐、设备控制或语音输出。"
       },
       "0.8.1": {
         "en": "Fix: AI messages were executed multiple times (e.g. 3x in Telegram). The timer system in aiHelper has been reworked: late executions now only run during the first 3 minutes after adapter start. All AI weather modules now trigger exactly once per day again. Stability improvements in the daily timers.",
         "de": "Fix: KI-Meldungen wurden mehrfach ausgeführt (z.B. 3× in Telegram). Das Timer-System im aiHelper wurde überarbeitet: Nachholausführungen laufen jetzt nur noch in den ersten 3 Minuten nach Adapterstart. Alle AI-Wettermodule werden wieder exakt einmal pro Tag ausgelöst. Stabilitätsverbesserungen bei den täglichen Timern.",
         "ru": "Исправление: сообщения ИИ выполнялись несколько раз (например, 3× в Telegram). Таймерная система в aiHelper была переработана: пропущенные задачи выполняются только в первые 3 минуты после запуска адаптера. Все модули погоды ИИ снова выполняются строго один раз в день.",
         "pt": "Correção: mensagens de IA eram executadas várias vezes (ex.: 3× no Telegram). O sistema de temporizadores do aiHelper foi reestruturado: execuções atrasadas agora ocorrem apenas nos primeiros 3 minutos após iniciar o adaptador. Todos os módulos de clima da IA voltam a ser executados exatamente uma vez por dia.",
         "nl": "Fix: AI-berichten werden meerdere keren uitgevoerd (bijv. 3× in Telegram). Het timersysteem in aiHelper is herwerkt: inhaaluitvoeringen draaien nu alleen in de eerste 3 minuten na adapterstart. Alle AI-weermodules worden weer precies één keer per dag uitgevoerd.",
         "fr": "Correctif : les messages IA étaient exécutés plusieurs fois (ex. 3× dans Telegram). Le système de minuteries dans aiHelper a été revu : les exécutions différées ne s'exécutent plus que pendant les 3 premières minutes après le démarrage. Tous les modules météo IA se déclenchent à nouveau exactement une fois par jour.",
         "it": "Fix: i messaggi dell'IA venivano eseguiti più volte (es. 3× su Telegram). Il sistema di timer dell'aiHelper è stato rivisto: le esecuzioni recuperate ora avvengono solo nei primi 3 minuti dopo l'avvio dell'adattatore. Tutti i moduli meteo IA ora si attivano nuovamente una sola volta al giorno.",
         "es": "Corrección: los mensajes de IA se ejecutaban varias veces (p. ej., 3× en Telegram). Se ha rediseñado el sistema de temporizadores en aiHelper: las ejecuciones atrasadas ahora solo ocurren en los primeros 3 minutos tras iniciar el adaptador. Todos los módulos meteorológicos de IA vuelven a ejecutarse una sola vez al día.",
         "pl": "Poprawka: komunikaty AI były wykonywane wielokrotnie (np. 3× w Telegramie). System timerów w aiHelper został przebudowany: zaległe wykonania działają teraz tylko w pierwszych 3 minutach po uruchomieniu adaptera. Wszystkie moduły pogodowe AI znów uruchamiają się dokładnie raz dziennie.",
         "uk": "Виправлення: повідомлення ШІ виконувалися кілька разів (наприклад, 3× у Telegram). Систему таймерів в aiHelper перероблено: запізнілі виконання відбуваються лише в перші 3 хвилини після запуску. Усі погодні модулі ШІ знову працюють рівно один раз на добу.",
         "zh-cn": "修复：AI 消息会被多次执行（例如在 Telegram 中出现 3 次）。已重构 aiHelper 中的计时器系统：补偿执行现在仅在适配器启动后的前 3 分钟内运行。所有 AI 天气模块现在每天只会执行一次。"
       },
       "0.8.0": {
         "en": "New: Introduction of the AI Forecast System (aiForecastHelper). The adapter now creates a daily weather forecast for tomorrow, including temperature range, weather description, rain probability, wind analysis, and pool recommendations. New switches, schedules and outputs were added under ai.weather.*. First execution runs automatically at adapter start. Admin interface updated with important AI information.",
         "de": "Neu: Einführung des KI-Vorhersagesystems (aiForecastHelper). Der Adapter erstellt nun täglich eine Wettervorhersage für morgen – inklusive Temperaturspanne, Wetterbeschreibung, Regenwahrscheinlichkeit, Windanalyse und Pool-Empfehlungen. Neue Schalter, Zeitpläne und Ausgaben unter ai.weather.* hinzugefügt. Erste Ausführung erfolgt automatisch beim Adapterstart. Admin-Oberfläche um wichtige KI-Hinweise erweitert.",
         "ru": "Новое: Введена система ИИ-прогноза (aiForecastHelper). Адаптер теперь ежедневно создаёт прогноз погоды на завтра: диапазон температур, описание погоды, вероятность дождя, анализ ветра и рекомендации по бассейну. Добавлены новые переключатели, расписания и выходы в ai.weather.*. Первое выполнение происходит автоматически при запуске адаптера. Интерфейс администратора обновлён важной информацией об ИИ.",
         "pt": "Novo: Introdução do sistema de previsão por IA (aiForecastHelper). O adaptador agora cria diariamente uma previsão do tempo para amanhã, incluindo faixa de temperatura, descrição do clima, probabilidade de chuva, análise de vento e recomendações para a piscina. Novos interruptores, horários e saídas adicionados em ai.weather.*. A primeira execução ocorre automaticamente ao iniciar o adaptador. Interface administrativa atualizada com informações importantes sobre IA.",
         "nl": "Nieuw: Introductie van het AI-voorspellingssysteem (aiForecastHelper). De adapter maakt nu dagelijks een weersvoorspelling voor morgen, inclusief temperatuurbereik, weertype, regenkans, windanalyse en zwembad-aanbevelingen. Nieuwe schakelaars, schema's en outputs toegevoegd onder ai.weather.*. Eerste uitvoering gebeurt automatisch bij het starten van de adapter. Admin-interface uitgebreid met belangrijke AI-informatie.",
         "fr": "Nouveau : Introduction du système de prévision IA (aiForecastHelper). L’adaptateur génère désormais chaque jour une prévision météo pour le lendemain, incluant plage de températures, description du temps, probabilité de pluie, analyse du vent et recommandations pour la piscine. Nouveaux commutateurs, horaires et sorties ajoutés sous ai.weather.*. Première exécution automatique au démarrage de l’adaptateur. Interface admin enrichie d’informations importantes sur l’IA.",
         "it": "Novità: Introduzione del sistema di previsione IA (aiForecastHelper). L’adattatore ora genera quotidianamente una previsione del tempo per domani, inclusi intervallo di temperature, descrizione del meteo, probabilità di pioggia, analisi del vento e raccomandazioni per la piscina. Aggiunti nuovi switch, pianificazioni e output sotto ai.weather.*. Prima esecuzione automatica all'avvio dell’adattatore. Interfaccia admin aggiornata con importanti informazioni sull’IA.",
         "es": "Nuevo: Introducción del sistema de previsión por IA (aiForecastHelper). El adaptador ahora genera un pronóstico diario del clima para mañana, incluyendo rango de temperatura, descripción del clima, probabilidad de lluvia, análisis del viento y recomendaciones para la piscina. Nuevos interruptores, horarios y salidas añadidos en ai.weather.*. La primera ejecución ocurre automáticamente al iniciar el adaptador. Interfaz de administración actualizada con información importante sobre IA.",
         "pl": "Nowość: Wprowadzenie systemu prognoz opartego na AI (aiForecastHelper). Adapter tworzy teraz codzienną prognozę pogody na jutro, obejmującą zakres temperatur, opis pogody, prawdopodobieństwo opadów, analizę wiatru oraz zalecenia dla basenu. Dodano nowe przełączniki, harmonogramy i wyjścia w ai.weather.*. Pierwsze uruchomienie następuje automatycznie przy starcie adaptera. Interfejs administracyjny został uzupełniony o ważne informacje dotyczące AI.",
         "uk": "Нове: Впроваджено систему прогнозування на основі ШІ (aiForecastHelper). Адаптер тепер щоденно створює прогноз погоди на завтра: діапазон температур, опис погоди, ймовірність опадів, аналіз вітру та рекомендації для басейну. Додано нові перемикачі, розклади та виходи в ai.weather.*. Перше виконання відбувається автоматично під час запуску адаптера. Адмін-інтерфейс оновлено важливою інформацією щодо ШІ.",
         "zh-cn": "新增：引入 AI 预报系统（aiForecastHelper）。适配器现在每天生成明天的天气预报，包括温度范围、天气描述、降雨概率、风力分析和泳池建议。新增了 ai.weather.* 下的开关、计划和输出。首次执行在适配器启动时自动进行。管理界面已更新，包含重要的 AI 信息。"
       },
       "0.7.4": {
         "en": "Improvement: The circulation mode (control.circulation.mode) is now fully protected against reinstall/overinstall. User-defined values are no longer overwritten during adapter update or restart.",
         "de": "Verbesserung: Der Umwälzungsmodus (control.circulation.mode) ist jetzt vollständig gegen Überinstallation geschützt. Benutzerwerte werden bei Adapter-Update oder Neustart nicht mehr überschrieben.",
         "ru": "Улучшение: режим циркуляции (control.circulation.mode) теперь полностью защищен от переустановки. Пользовательские значения больше не перезаписываются при обновлении или перезапуске адаптера.",
         "pt": "Melhoria: O modo de circulação (control.circulation.mode) agora está totalmente protegido contra reinstalações. Os valores definidos pelo usuário não são mais substituídos durante atualização ou reinicialização do adaptador.",
         "nl": "Verbetering: De circulatiemodus (control.circulation.mode) is nu volledig beschermd tegen overinstallaties. Door de gebruiker ingestelde waarden worden niet langer overschreven bij een update of herstart.",
         "fr": "Amélioration : Le mode de circulation (control.circulation.mode) est désormais entièrement protégé contre les réinstallations. Les valeurs définies par l’utilisateur ne sont plus écrasées lors d’une mise à jour ou d’un redémarrage de l’adaptateur.",
         "it": "Miglioramento: La modalità di circolazione (control.circulation.mode) è ora completamente protetta da reinstallazioni. I valori utente non vengono più sovrascritti durante aggiornamenti o riavvii dell’adattatore.",
         "es": "Mejora: El modo de circulación (control.circulation.mode) ahora está completamente protegido contra reinstalaciones. Los valores del usuario ya no se sobrescriben durante actualizaciones o reinicios del adaptador.",
         "pl": "Ulepszenie: Tryb cyrkulacji (control.circulation.mode) jest teraz w pełni chroniony przed ponowną instalacją. Wartości użytkownika nie są już nadpisywane podczas aktualizacji lub restartu adaptera.",
         "uk": "Покращення: Режим циркуляції (control.circulation.mode) тепер повністю захищений від повторної інсталяції. Значення користувача більше не перезаписуються під час оновлення або перезапуску адаптера.",
         "zh-cn": "改进：循环模式（control.circulation.mode）现已完全受保护，不会在重新安装或更新适配器时被覆盖。"
       },
       "0.7.3": {
         "en": "Fix in seasonal greetings: Christmas greeting now only appears between December 20 and 27. Incorrect early activation has been corrected.",
         "de": "Fix bei den saisonalen Grüßen: Weihnachtsgruß erscheint nun korrekt nur vom 20. bis 27. Dezember. Fehlerhafte frühzeitige Aktivierung wurde behoben.",
         "ru": "Исправление сезонных поздравлений: Рождественское поздравление теперь отображается только с 20 по 27 декабря. Ошибочное раннее срабатывание исправлено.",
         "pt": "Correção nos cumprimentos sazonais: A saudação de Natal agora aparece corretamente apenas entre 20 e 27 de dezembro. Ativação incorreta antecipada foi corrigida.",
         "nl": "Fix in seizoensgroeten: Kerstgroet verschijnt nu correct alleen van 20 t/m 27 december. Onjuiste vroege activering is verholpen.",
         "fr": "Correction des messages saisonniers : le message de Noël apparaît désormais uniquement du 20 au 27 décembre. L’activation prématurée incorrecte a été corrigée.",
         "it": "Correzione nei saluti stagionali: l’augurio di Natale ora appare correttamente solo dal 20 al 27 dicembre. Corretto il problema dell'attivazione anticipata.",
         "es": "Corrección en los saludos estacionales: el mensaje de Navidad ahora aparece correctamente solo del 20 al 27 de diciembre. Se corrigió la activación anticipada incorrecta.",
         "pl": "Poprawka pozdrowień sezonowych: życzenia świąteczne pojawiają się teraz prawidłowo tylko między 20 a 27 grudnia. Błędna przedwczesna aktywacja została naprawiona.",
         "uk": "Виправлено сезонні вітання: Різдвяне привітання тепер з’являється лише з 20 по 27 грудня. Помилкове передчасне спрацьовування виправлено.",
         "zh-cn": "修复季节性问候：圣诞问候现在仅在 12 月 20 日至 27 日之间显示。已修复错误的提前触发问题。"
       },
       "0.7.2": {
         "en": "Added new info system: The adapter now writes seasonal greetings and the installed adapter version to info.* states. Includes automatic daily refresh at 00:01 and full Easter date calculation.",
         "de": "Neues Info-System hinzugefügt: Der Adapter schreibt nun saisonale Grüße und die installierte Adapterversion in die info.* States. Enthält eine automatische tägliche Aktualisierung um 00:01 sowie eine vollständige Oster-Berechnung.",
         "ru": "Добавлена новая информационная система: адаптер теперь записывает сезонные поздравления и установленную версию адаптера в состояния info.*. Включает ежедневное обновление в 00:01 и полный расчёт даты Пасхи.",
         "pt": "Novo sistema de informações adicionado: o adaptador agora grava saudações sazonais e a versão instalada do adaptador nos estados info.*. Inclui atualização diária automática às 00:01 e cálculo completo da data da Páscoa.",
         "nl": "Nieuw infosysteem toegevoegd: de adapter schrijft nu seizoensgroeten en de geïnstalleerde adapterversie naar info.*-states. Inclusief automatische dagelijkse update om 00:01 en volledige berekening van Pasen.",
         "fr": "Nouveau système d'informations ajouté : l'adaptateur écrit désormais des messages saisonniers et la version installée dans les états info.*. Comprend une mise à jour quotidienne automatique à 00:01 et un calcul complet de la date de Pâques.",
         "it": "Aggiunto nuovo sistema informativo: l'adattatore ora scrive i saluti stagionali e la versione installata negli stati info.*. Include aggiornamento giornaliero automatico alle 00:01 e calcolo completo della data di Pasqua.",
         "es": "Nuevo sistema de información añadido: el adaptador ahora escribe saludos estacionales y la versión instalada en los estados info.*. Incluye actualización automática diaria a las 00:01 y cálculo completo de la fecha de Pascua.",
         "pl": "Dodano nowy system informacji: adapter zapisuje teraz sezonowe pozdrowienia oraz zainstalowaną wersję adaptera w stanach info.*. Zawiera automatyczne codzienne odświeżanie o 00:01 oraz pełne wyliczenie daty Wielkanocy.",
         "uk": "Додано нову інформаційну систему: адаптер тепер записує сезонні привітання та встановлену версію адаптера в стани info.*. Містить щоденне автоматичне оновлення о 00:01 і повний розрахунок дати Великодня.",
         "zh-cn": "新增信息系统：适配器现在会将季节性问候和已安装的适配器版本写入 info.* 状态。包括每天 00:01 的自动刷新和完整的复活节日期计算。"
       }
	},
    "titleLang": {
      "en": "PoolControl",
      "de": "PoolControl",
      "ru": "PoolControl",
      "pt": "PoolControl",
      "nl": "PoolControl",
      "fr": "PoolControl",
      "it": "PoolControl",
      "es": "PoolControl",
      "pl": "PoolControl",
      "uk": "PoolControl",
      "zh-cn": "PoolControl"
    },
    "desc": {
      "en": "Adapter for controlling and monitoring pool systems (pump, temperature, solar, consumption, speech output).",
      "de": "Adapter zur Steuerung und Überwachung von Poolanlagen (Pumpe, Temperatur, Solar, Verbrauch, Sprachausgaben).",
      "ru": "Адаптер для управления и мониторинга бассейнов (насос, температура, солнечная система, потребление, голосовые оповещения).",
      "pt": "Adaptador para controlar e monitorar sistemas de piscina (bomba, temperatura, solar, consumo, saída de voz).",
      "nl": "Adapter voor het besturen en bewaken van zwembadsystemen (pomp, temperatuur, zonne-energie, verbruik, spraakuitvoer).",
      "fr": "Adaptateur pour contrôler et surveiller les systèmes de piscine (pompe, température, solaire, consommation, sorties vocales).",
      "it": "Adattatore per il controllo e il monitoraggio dei sistemi della piscina (pompa, temperatura, solare, consumo, uscite vocali).",
      "es": "Adaptador para controlar y supervisar sistemas de piscina (bomba, temperatura, solar, consumo, salida de voz).",
      "pl": "Adapter do sterowania i monitorowania systemów basenowych (pompa, temperatura, solar, zużycie, komunikaty głosowe).",
      "uk": "Адаптер для керування та моніторингу басейнових систем (насос, температура, сонячна енергія, споживання, голосові повідомлення).",
      "zh-cn": "用于控制和监控泳池系统的适配器（泵、温度、太阳能、能耗、语音输出）。"
    },
    "authors": [
      "DasBo1975 <dasbo1975@outlook.de>"
    ],
    "keywords": [
      "pool",
      "pumpe",
      "solar",
      "wasser",
      "temperatur"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "poolcontrol.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/DasBo1975/ioBroker.poolcontrol/main/admin/poolcontrol.png",
    "readme": "https://github.com/DasBo1975/ioBroker.poolcontrol/blob/main/README.md",
    "loglevel": "info",
    "ignoreLogs": [
      "State .*speech\\.solar_active.* has no existing object",
      "State .*speech\\.frost_active.* has no existing object",
      "State .*speech\\.time_active.* has no existing object"
    ],
    "tier": 3,
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
	"globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "option1": true,
    "option2": "42"
  },
  "objects": [],
  "instanceObjects": []
}

