{
  "common": {
    "name": "poolcontrol",
    "version": "0.1.2",
    "news": {
      "0.1.2": {
       "en": "Improved: The last known temperature values of all active sensors are now read at adapter start. Sensors that report rarely are now displayed correctly.",
       "de": "Verbesserung: Beim Adapterstart werden nun die letzten bekannten Temperaturwerte aller aktiven Sensoren übernommen. Sensoren, die nur selten Werte senden, werden jetzt korrekt angezeigt.",
       "ru": "Улучшение: При запуске адаптера теперь считываются последние известные значения температуры всех активных датчиков.",
       "pt": "Melhoria: Os últimos valores de temperatura conhecidos de todos os sensores ativos agora são lidos ao iniciar o adaptador.",
       "nl": "Verbetering: Bij het starten van de adapter worden nu de laatst bekende temperatuurwaarden van alle actieve sensoren opgehaald.",
       "fr": "Amélioration : les dernières valeurs de température connues de tous les capteurs actifs sont désormais lues au démarrage de l’adaptateur.",
       "it": "Miglioramento: all'avvio dell'adattatore vengono ora letti gli ultimi valori di temperatura noti di tutti i sensori attivi.",
       "es": "Mejora: ahora se leen al iniciar el adaptador los últimos valores de temperatura conocidos de todos los sensores activos.",
       "pl": "Ulepszenie: podczas uruchamiania adaptera odczytywane są ostatnie znane wartości temperatury wszystkich aktywnych czujników.",
       "uk": "Покращення: під час запуску адаптера тепер зчитуються останні відомі значення температури всіх активних датчиків.",
       "zh-cn": "改进：适配器启动时现在会读取所有活动传感器的最后已知温度值。"
      },
      "0.1.1": {
       "en": "Fixed endless loop between pump_switch and deviceId for some smart sockets",
       "de": "Endlosschleife zwischen pump_switch und Steckdose (deviceId) behoben",
       "ru": "Исправлен бесконечный цикл между pump_switch и deviceId для некоторых умных розеток",
       "pt": "Corrigido loop infinito entre pump_switch e deviceId em algumas tomadas inteligentes",
       "nl": "Eindeloze lus tussen pump_switch en deviceId voor sommige slimme stopcontacten opgelost",
       "fr": "Correction d'une boucle infinie entre pump_switch et deviceId pour certaines prises intelligentes",
       "it": "Corretto loop infinito tra pump_switch e deviceId per alcune prese intelligenti",
       "es": "Corregido bucle infinito entre pump_switch y deviceId en algunos enchufes inteligentes",
       "pl": "Naprawiono nieskończoną pętlę między pump_switch a deviceId dla niektórych inteligentnych gniazdek",
       "uk": "Виправлено нескінченний цикл між pump_switch і deviceId для деяких розумних розеток",
       "zh-cn": "修复了某些智能插座中 pump_switch 与 deviceId 之间的无限循环"
      },
      "0.1.0": {
       "en": "Added speech output via E-Mail (configurable: instance, recipient, subject)",
       "de": "Sprachausgabe per E-Mail hinzugefügt (konfigurierbar: Instanz, Empfänger, Betreff)",
       "ru": "Добавлен вывод речи по электронной почте (настраивается: экземпляр, получатель, тема)",
       "pt": "Adicionada saída de fala por e-mail (configurável: instância, destinatário, assunto)",
       "nl": "Spraakuitvoer via e-mail toegevoegd (configureerbaar: instantie, ontvanger, onderwerp)",
       "fr": "Ajout de la sortie vocale par e-mail (configurable : instance, destinataire, sujet)",
       "it": "Aggiunta uscita vocale via e-mail (configurabile: istanza, destinatario, oggetto)",
       "es": "Se agregó salida de voz por correo electrónico (configurable: instancia, destinatario, asunto)",
       "pl": "Dodano wyjście głosowe przez e-mail (konfigurowalne: instancja, odbiorca, temat)",
       "uk": "Додано озвучення електронною поштою (налаштовується: екземпляр, одержувач, тема)",
       "zh-cn": "新增通过电子邮件的语音输出（可配置：实例、收件人、主题）"
      },
      "0.0.10": {
       "en": "Added extended status overview with pump statistics, system flags and JSON summary",
       "de": "Erweiterte Statusübersicht mit Pumpenstatistiken, Systemanzeigen und JSON-Zusammenfassung hinzugefügt",
       "ru": "Добавлен расширенный обзор состояния с насосной статистикой, системными флагами и JSON-резюме",
       "pt": "Adicionada visão geral de status estendida com estatísticas da bomba, sinalizadores do sistema e resumo em JSON",
       "nl": "Uitgebreide statusoverzicht toegevoegd met pompstatistieken, systeemindicatoren en JSON-samenvatting",
       "fr": "Aperçu du statut étendu ajouté avec statistiques de la pompe, indicateurs système et résumé JSON",
       "it": "Aggiunta panoramica dello stato estesa con statistiche della pompa, indicatori di sistema e riepilogo JSON",
       "es": "Añadida vista general de estado extendida con estadísticas de la bomba, indicadores del sistema y resumen en JSON",
       "pl": "Dodano rozszerzony przegląd statusu ze statystykami pompy, flagami systemowymi i podsumowaniem JSON",
       "uk": "Додано розширений огляд статусу зі статистикою насоса, системними прапорцями та зведенням JSON",
       "zh-cn": "新增扩展状态概览，包括泵统计、系统标志和 JSON 摘要"
      }
    },
    "titleLang": {
      "en": "PoolControl",
      "de": "PoolControl",
      "ru": "PoolControl",
      "pt": "PoolControl",
      "nl": "PoolControl",
      "fr": "PoolControl",
      "it": "PoolControl",
      "es": "PoolControl",
      "pl": "PoolControl",
      "uk": "PoolControl",
      "zh-cn": "PoolControl"
    },
    "desc": {
      "en": "Adapter for controlling and monitoring pool systems (pump, temperature, solar, consumption, speech output).",
      "de": "Adapter zur Steuerung und Überwachung von Poolanlagen (Pumpe, Temperatur, Solar, Verbrauch, Sprachausgaben).",
      "ru": "Адаптер для управления и мониторинга бассейнов (насос, температура, солнечная система, потребление, голосовые оповещения).",
      "pt": "Adaptador para controlar e monitorar sistemas de piscina (bomba, temperatura, solar, consumo, saída de voz).",
      "nl": "Adapter voor het besturen en bewaken van zwembadsystemen (pomp, temperatuur, zonne-energie, verbruik, spraakuitvoer).",
      "fr": "Adaptateur pour contrôler et surveiller les systèmes de piscine (pompe, température, solaire, consommation, sorties vocales).",
      "it": "Adattatore per il controllo e il monitoraggio dei sistemi della piscina (pompa, temperatura, solare, consumo, uscite vocali).",
      "es": "Adaptador para controlar y supervisar sistemas de piscina (bomba, temperatura, solar, consumo, salida de voz).",
      "pl": "Adapter do sterowania i monitorowania systemów basenowych (pompa, temperatura, solar, zużycie, komunikaty głosowe).",
      "uk": "Адаптер для керування та моніторингу басейнових систем (насос, температура, сонячна енергія, споживання, голосові повідомлення).",
      "zh-cn": "用于控制和监控泳池系统的适配器（泵、温度、太阳能、能耗、语音输出）。"
    },
    "authors": [
      "DasBo1975 <dasbo1975@outlook.de>"
    ],
    "keywords": [
      "pool",
      "pumpe",
      "solar",
      "wasser",
      "temperatur"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "poolcontrol.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/DasBo1975/ioBroker.poolcontrol/main/admin/poolcontrol.png",
    "readme": "https://github.com/DasBo1975/ioBroker.poolcontrol/blob/main/README.md",
    "loglevel": "info",
    "tier": 3,
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
	"globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "option1": true,
    "option2": "42"
  },
  "objects": [],
  "instanceObjects": []
  }

