{
  "common": {
    "name": "poolcontrol",
    "version": "0.0.7",
    "news": {
      "0.0.7": {
        "en": "Added help file (help.md) and first README version",
        "de": "Hilfedatei (help.md) und erste README-Version hinzugefügt",
        "ru": "Добавлен файл справки (help.md) и первая версия README",
        "pt": "Adicionado arquivo de ajuda (help.md) e primeira versão do README",
        "nl": "Helpbestand (help.md) en eerste README-versie toegevoegd",
        "fr": "Ajout du fichier d'aide (help.md) et première version du README",
        "it": "Aggiunto file di aiuto (help.md) e prima versione di README",
        "es": "Se agregó archivo de ayuda (help.md) y primera versión de README",
        "pl": "Dodano plik pomocy (help.md) i pierwszą wersję README",
        "uk": "Додано файл довідки (help.md) та першу версію README",
        "zh-cn": "添加了帮助文件 (help.md) 和第一个 README 版本"
      },
      "0.0.6": {
        "en": "Added consumption & cost calculation with external kWh meter",
        "de": "Verbrauchs- und Kostenberechnung mit externem kWh-Zähler hinzugefügt",
        "ru": "Добавлен расчет потребления и затрат с внешним счетчиком кВт·ч",
        "pt": "Adicionado cálculo de consumo e custo com medidor externo de kWh",
        "nl": "Verbruik- en kostenberekening toegevoegd met externe kWh-meter",
        "fr": "Ajout du calcul de consommation et de coût avec compteur kWh externe",
        "it": "Aggiunto calcolo di consumo e costi con contatore kWh esterno",
        "es": "Se agregó cálculo de consumo y costos con medidor externo de kWh",
        "pl": "Dodano obliczanie zużycia i kosztów z zewnętrznym licznikiem kWh",
        "uk": "Додано розрахунок споживання та витрат із зовнішнім лічильником кВт·год",
        "zh-cn": "新增使用外部千瓦时电表的消耗和成本计算"
      },
      "0.0.5": {
        "en": "Added speech output via Alexa and Telegram",
        "de": "Sprachausgaben über Alexa und Telegram hinzugefügt",
        "ru": "Добавлен голосовой вывод через Alexa и Telegram",
        "pt": "Adicionada saída de voz via Alexa e Telegram",
        "nl": "Spraakuitvoer toegevoegd via Alexa en Telegram",
        "fr": "Ajout de la sortie vocale via Alexa et Telegram",
        "it": "Aggiunta uscita vocale tramite Alexa e Telegram",
        "es": "Se agregó salida de voz a través de Alexa y Telegram",
        "pl": "Dodano wyjście głosowe przez Alexa i Telegram",
        "uk": "Додано голосовий вивід через Alexa та Telegram",
        "zh-cn": "新增通过 Alexa 和 Telegram 的语音输出"
      },
      "0.0.4": {
        "en": "Added runtime & circulation logic including new datapoint 'circulation.daily_required'",
        "de": "Laufzeit- und Umwälzlogik hinzugefügt, einschließlich neuem Datenpunkt 'circulation.daily_required'",
        "ru": "Добавлена логика времени работы и циркуляции, включая новую точку данных 'circulation.daily_required'",
        "pt": "Adicionada lógica de tempo de execução e circulação, incluindo novo datapoint 'circulation.daily_required'",
        "nl": "Runtime- en circulatielogica toegevoegd, inclusief nieuw datapoint 'circulation.daily_required'",
        "fr": "Ajout de la logique de temps d'exécution et de circulation, y compris le nouveau point de données 'circulation.daily_required'",
        "it": "Aggiunta logica di runtime e circolazione, incluso nuovo datapoint 'circulation.daily_required'",
        "es": "Se agregó lógica de tiempo de ejecución y circulación, incluido nuevo datapoint 'circulation.daily_required'",
        "pl": "Dodano logikę czasu pracy i cyrkulacji, w tym nowy punkt danych 'circulation.daily_required'",
        "uk": "Додано логіку часу роботи та циркуляції, включаючи нову точку даних 'circulation.daily_required'",
        "zh-cn": "新增运行时间和循环逻辑，包括新数据点 'circulation.daily_required'"
      },
      "0.0.3": {
        "en": "Added time control with up to 3 configurable time windows",
        "de": "Zeitsteuerung mit bis zu 3 konfigurierbaren Zeitfenstern hinzugefügt",
        "ru": "Добавлено управление временем с до 3 настраиваемыми временными окнами",
        "pt": "Adicionado controle de tempo com até 3 janelas de tempo configuráveis",
        "nl": "Tijdregeling toegevoegd met maximaal 3 configureerbare tijdvensters",
        "fr": "Ajout du contrôle du temps avec jusqu'à 3 fenêtres de temps configurables",
        "it": "Aggiunto controllo del tempo con fino a 3 finestre temporali configurabili",
        "es": "Se agregó control de tiempo con hasta 3 ventanas de tiempo configurables",
        "pl": "Dodano kontrolę czasu z maksymalnie 3 konfigurowalnymi oknami czasowymi",
        "uk": "Додано керування часом з до 3 налаштовуваними часовими вікнами",
        "zh-cn": "新增时间控制，最多可配置 3 个时间窗口"
      },
      "0.0.2": {
        "en": "Extended pump logic with error detection and safety functions",
        "de": "Pumpenlogik erweitert mit Fehlererkennung und Sicherheitsfunktionen",
        "ru": "Расширена логика насоса с обнаружением ошибок и функциями безопасности",
        "pt": "Lógica da bomba estendida com detecção de erros e funções de segurança",
        "nl": "Pomplogica uitgebreid met foutdetectie en veiligheidsfuncties",
        "fr": "Logique de pompe étendue avec détection d'erreurs et fonctions de sécurité",
        "it": "Logica della pompa estesa con rilevamento errori e funzioni di sicurezza",
        "es": "Lógica de la bomba ampliada con detección de errores y funciones de seguridad",
        "pl": "Rozszerzona logika pompy z wykrywaniem błędów i funkcjami bezpieczeństwa",
        "uk": "Розширена логіка насоса з виявленням помилок та функціями безпеки",
        "zh-cn": "扩展泵逻辑，具有错误检测和安全功能"
      },
      "0.0.1": {
        "en": "initial release",
        "de": "Erstveröffentlichung",
        "ru": "Начальная версия",
        "pt": "lançamento inicial",
        "nl": "Eerste uitgave",
        "fr": "Première version",
        "it": "Versione iniziale",
        "es": "Versión inicial",
        "pl": "Pierwsze wydanie",
        "uk": "Початкова версія",
        "zh-cn": "首次出版"
      }
    },
    "titleLang": {
      "en": "PoolControl",
      "de": "PoolControl",
      "ru": "PoolControl",
      "pt": "PoolControl",
      "nl": "PoolControl",
      "fr": "PoolControl",
      "it": "PoolControl",
      "es": "PoolControl",
      "pl": "PoolControl",
      "uk": "PoolControl",
      "zh-cn": "PoolControl"
    },
    "desc": {
      "en": "Adapter for controlling and monitoring pool systems (pump, temperature, solar, consumption, speech output).",
      "de": "Adapter zur Steuerung und Überwachung von Poolanlagen (Pumpe, Temperatur, Solar, Verbrauch, Sprachausgaben).",
      "ru": "Адаптер для управления и мониторинга бассейнов (насос, температура, солнечная система, потребление, голосовые оповещения).",
      "pt": "Adaptador para controlar e monitorar sistemas de piscina (bomba, temperatura, solar, consumo, saída de voz).",
      "nl": "Adapter voor het besturen en bewaken van zwembadsystemen (pomp, temperatuur, zonne-energie, verbruik, spraakuitvoer).",
      "fr": "Adaptateur pour contrôler et surveiller les systèmes de piscine (pompe, température, solaire, consommation, sorties vocales).",
      "it": "Adattatore per il controllo e il monitoraggio dei sistemi della piscina (pompa, temperatura, solare, consumo, uscite vocali).",
      "es": "Adaptador para controlar y supervisar sistemas de piscina (bomba, temperatura, solar, consumo, salida de voz).",
      "pl": "Adapter do sterowania i monitorowania systemów basenowych (pompa, temperatura, solar, zużycie, komunikaty głosowe).",
      "uk": "Адаптер для керування та моніторингу басейнових систем (насос, температура, сонячна енергія, споживання, голосові повідомлення).",
      "zh-cn": "用于控制和监控泳池系统的适配器（泵、温度、太阳能、能耗、语音输出）。"
    },
    "authors": [
      "DasBo1975 <dasbo1975@outlook.de>"
    ],
    "keywords": [
      "pool",
      "pumpe",
      "solar",
      "wasser",
      "temperatur"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "poolcontrol.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/DasBo1975/ioBroker.poolcontrol/main/admin/poolcontrol.png",
    "readme": "https://github.com/DasBo1975/ioBroker.poolcontrol/blob/main/README.md",
    "loglevel": "info",
    "tier": 3,
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.0.23"
      }
    ]
  },
  "native": {
    "option1": true,
    "option2": "42"
  },
  "objects": [],
  "instanceObjects": [],
  "support": {
    "donate": {
      "paypal": "https://www.paypal.com/donate?business=dirk.bertin%40t-online.de"
    }
  }
}

