{
  "common": {
    "name": "poolcontrol",
    "version": "0.7.0",
    "news": {
       "0.7.0": {
         "en": "Added full pressure sensor integration (pump.pressure.*), including trend detection, self-learning min/max values, diagnostic output and configurable normal pressure range. No automatic control logic – purely informative.",
         "de": "Vollständige Drucksensor-Integration (pump.pressure.*) hinzugefügt, inklusive Trenderkennung, selbstlernenden Min-/Max-Werten, Diagnoseausgabe und einstellbarem Normaldruckbereich. Keine automatische Logik – rein informativ.",
         "ru": "Добавлена полная интеграция датчика давления (pump.pressure.*), включая определение тренда, самообучающиеся минимальные/максимальные значения, диагностический вывод и настраиваемый диапазон нормального давления. Без автоматической логики – только информация.",
         "pt": "Adicionada integração completa do sensor de pressão (pump.pressure.*), incluindo detecção de tendência, valores mínimos/máximos autoaprendidos, saída de diagnóstico e faixa de pressão normal configurável. Sem lógica automática – apenas informativo.",
         "nl": "Volledige druksensorintegratie (pump.pressure.*) toegevoegd, inclusief trenddetectie, zelflerende min/max-waarden, diagnostische uitvoer en instelbaar normaaldrukbereik. Geen automatische logica – puur informatief.",
         "fr": "Intégration complète du capteur de pression (pump.pressure.*) ajoutée, comprenant la détection de tendance, des valeurs min/max auto-apprises, une sortie de diagnostic et une plage de pression normale configurable. Aucune logique automatique – uniquement informatif.",
         "it": "Aggiunta integrazione completa del sensore di pressione (pump.pressure.*), con rilevamento delle tendenze, valori min/max autoapprendenti, output diagnostico e intervallo di pressione normale configurabile. Nessuna logica automatica – solo informativo.",
         "es": "Se añadió la integración completa del sensor de presión (pump.pressure.*), incluyendo detección de tendencia, valores mínimos/máximos autoaprendidos, salida de diagnóstico y rango de presión normal configurable. Sin lógica automática – solo informativo.",
         "pl": "Dodano pełną integrację czujnika ciśnienia (pump.pressure.*), w tym wykrywanie trendów, samo uczące się wartości min/max, dane diagnostyczne oraz konfigurowalny zakres ciśnienia normalnego. Bez automatycznej logiki – wyłącznie informacyjne.",
         "uk": "Додано повну інтеграцію датчика тиску (pump.pressure.*), включаючи визначення трендів, самонавчальні мін/макс значення, діагностичний вихід та налаштовуваний діапазон нормального тиску. Без автоматичної логіки – лише інформаційно.",
         "zh-cn": "新增完整压力传感器集成 (pump.pressure.*)，包括趋势检测、自学习最小/最大值、诊断输出以及可配置的正常压力范围。无自动控制逻辑，仅提供信息。"
       },
       "0.6.5": {
         "en": "Fix for weekly, monthly and yearly reset in consumptionHelper",
         "de": "Fix für Wochen-, Monats- und Jahres-Reset im ConsumptionHelper",
         "ru": "Исправление еженедельного, ежемесячного и ежегодного сброса в consumptionHelper",
         "pt": "Correção para redefinição semanal, mensal e anual no consumptionHelper",
         "nl": "Fix voor wekelijkse, maandelijkse en jaarlijkse reset in consumptionHelper",
         "fr": "Correctif pour la réinitialisation hebdomadaire, mensuelle et annuelle dans consumptionHelper",
         "it": "Correzione per il reset settimanale, mensile e annuale in consumptionHelper",
         "es": "Corrección para el reinicio semanal, mensual y anual en consumptionHelper",
         "pl": "Poprawka cotygodniowego, comiesięcznego i corocznego resetu w consumptionHelper",
         "uk": "Виправлення щотижневого, щомісячного та щорічного скидання в consumptionHelper",
         "zh-cn": "修复 consumptionHelper 中每周、每月和每年重置的问题"
       },
       "0.6.4": {
         "en": "Fix for weekly, monthly and yearly reset in consumptionHelper",
         "de": "Fix für Wochen-, Monats- und Jahres-Reset im ConsumptionHelper",
         "ru": "Исправление еженедельного, ежемесячного и ежегодного сброса в consumptionHelper",
         "pt": "Correção para redefinição semanal, mensal e anual no consumptionHelper",
         "nl": "Fix voor wekelijkse, maandelijkse en jaarlijkse reset in consumptionHelper",
         "fr": "Correctif pour la réinitialisation hebdomadaire, mensuelle et annuelle dans consumptionHelper",
         "it": "Correzione per il reset settimanale, mensile e annuale in consumptionHelper",
         "es": "Corrección para el reinicio semanal, mensual y anual en consumptionHelper",
         "pl": "Poprawka cotygodniowego, comiesięcznego i corocznego resetu w consumptionHelper",
         "uk": "Виправлення щотижневого, щомісячного та щорічного скидання в consumptionHelper",
         "zh-cn": "修复 consumptionHelper 中每周、每月和每年重置的问题"
       },
       "0.6.3": {
         "en": "Fix for weekly, monthly and yearly reset in consumptionHelper",
         "de": "Fix für Wochen-, Monats- und Jahres-Reset im ConsumptionHelper",
         "ru": "Исправление еженедельного, ежемесячного и ежегодного сброса в consumptionHelper",
         "pt": "Correção para redefinição semanal, mensal e anual no consumptionHelper",
         "nl": "Fix voor wekelijkse, maandelijkse en jaarlijkse reset in consumptionHelper",
         "fr": "Correctif pour la réinitialisation hebdomadaire, mensuelle et annuelle dans consumptionHelper",
         "it": "Correzione per il reset settimanale, mensile e annuale in consumptionHelper",
         "es": "Corrección para el reinicio semanal, mensual y anual en consumptionHelper",
         "pl": "Poprawka cotygodniowego, comiesięcznego i corocznego resetu w consumptionHelper",
         "uk": "Виправлення щотижневого, щомісячного та щорічного скидання в consumptionHelper",
         "zh-cn": "修复 consumptionHelper 中每周、每月和每年重置的问题"
       },
       "0.6.2": {
         "en": "UI refinement and admin interface improvements. Added image integration ('Egon in blue overalls') for visual identification. Speech system extended with Alexa output time configuration. Cleaned and optimized jsonConfig with section headers for improved clarity.",
         "de": "Oberflächenüberarbeitung und Verbesserungen der Admin-Ansicht. Bildintegration ('Egon im Blaumann') zur visuellen Wiedererkennung hinzugefügt. Sprachsystem um konfigurierbare Alexa-Ausgabezeiten erweitert. jsonConfig mit Abschnittsüberschriften bereinigt und übersichtlicher gestaltet.",
         "ru": "Улучшение интерфейса и доработка административной панели. Добавлено изображение ('Эгон в синем комбинезоне') для визуальной идентификации. Расширена система речи с настройкой времени вывода Alexa. Очищена и оптимизирована jsonConfig с заголовками разделов для лучшей читаемости.",
         "pt": "Aprimoramento da interface e melhorias na administração. Adicionada imagem ('Egon de macacão azul') para identificação visual. Sistema de fala ampliado com configuração de horários de saída Alexa. jsonConfig limpa e otimizada com cabeçalhos de seção para melhor clareza.",
         "nl": "UI verfijnd en verbeteringen in het beheerpaneel. Afbeelding ('Egon in blauwe overall') toegevoegd voor visuele herkenning. Spraaksysteem uitgebreid met Alexa-uitvoertijdaanpassing. jsonConfig opgeschoond en overzichtelijker gemaakt met sectiekoppen.",
         "fr": "Amélioration de l'interface utilisateur et du panneau d'administration. Image ajoutée ('Egon en bleu de travail') pour identification visuelle. Système vocal étendu avec configuration des heures de sortie Alexa. jsonConfig nettoyé et optimisé avec en-têtes de section pour plus de clarté.",
         "it": "Raffinamento dell'interfaccia e miglioramenti al pannello di amministrazione. Aggiunta l'immagine ('Egon in tuta blu') per l'identificazione visiva. Sistema vocale ampliato con configurazione degli orari di uscita Alexa. jsonConfig ripulito e ottimizzato con intestazioni di sezione per maggiore chiarezza.",
         "es": "Refinamiento de la interfaz y mejoras en el panel de administración. Se agregó imagen ('Egon con mono azul') para identificación visual. Sistema de voz ampliado con configuración de horarios de salida de Alexa. jsonConfig limpiado y optimizado con encabezados de sección para mayor claridad.",
         "pl": "Udoskonalenie interfejsu i panelu administracyjnego. Dodano obraz ('Egon w niebieskim kombinezonie') dla wizualnej identyfikacji. Rozszerzono system mowy o konfigurację czasu wyjścia Alexa. Wyczyczono i zoptymalizowano jsonConfig z nagłówkami sekcji dla lepszej przejrzystości.",
         "zh-cn": "改进了界面和管理界面。添加了图像（'蓝色工作服的Egon'）以实现视觉识别。语音系统扩展了Alexa输出时间配置。清理并优化了带有章节标题的jsonConfig，使其更清晰。"
       },
       "0.6.1": {
         "en": "Fixed false monthly reset when no last_reset date existed. Corrected real last_update timestamp in monthly statistics.",
         "de": "Fehlerhaften Monatsreset ohne gültiges last_reset-Datum behoben. Korrigierter echter Zeitstempel last_update in der Monatsstatistik.",
         "ru": "Исправлен неверный ежемесячный сброс без действительной даты last_reset. Исправлено обновление времени last_update в ежемесячной статистике.",
         "pt": "Corrigido o reset mensal incorreto quando não havia data last_reset. Corrigido o timestamp real de last_update na estatística mensal.",
         "nl": "Onjuiste maandelijkse reset opgelost wanneer er geen last_reset-datum was. Gecorrigeerde echte last_update-tijd in maandelijkse statistieken.",
         "fr": "Correction du réinitialisation mensuelle erronée lorsqu'aucune date last_reset n'existait. Horodatage last_update réel corrigé dans les statistiques mensuelles.",
         "it": "Corretto il reset mensile errato quando non esisteva una data last_reset. Corretto il timestamp reale last_update nelle statistiche mensili.",
         "es": "Corregido el restablecimiento mensual erróneo cuando no existía una fecha last_reset. Corregida la marca de tiempo real last_update en las estadísticas mensuales.",
         "pl": "Naprawiono błędny miesięczny reset, gdy nie istniała data last_reset. Poprawiono rzeczywisty znacznik czasu last_update w miesięcznych statystykach.",
         "zh-cn": "修复了在不存在 last_reset 日期时错误的月度重置。修正了月度统计中的真实 last_update 时间戳。"
       },
       "0.6.0": {
         "en": "Added complete photovoltaic control with automatic pump management (mode 'Automatik (PV)'). The adapter can now react to PV surplus based on configurable house consumption and generation values. Includes migration for existing installations. Improved system consistency and internal logging.",
         "de": "Vollständige Photovoltaik-Steuerung mit automatischer Pumpenlogik (Modus 'Automatik (PV)') hinzugefügt. Der Adapter reagiert nun auf PV-Überschuss anhand konfigurierbarer Hausverbrauchs- und Erzeugungswerte. Migration für bestehende Installationen integriert. Systemkonsistenz und interne Protokollierung verbessert.",
         "ru": "Добавлено полное управление фотоэлектрической системой с автоматическим управлением насосом (режим 'Automatik (PV)'). Адаптер теперь реагирует на избыток PV на основе настраиваемых значений потребления и генерации. Включена миграция для существующих установок. Улучшена системная согласованность и внутреннее ведение журнала.",
         "pt": "Adicionado controle fotovoltaico completo com gerenciamento automático da bomba (modo 'Automatik (PV)'). O adaptador agora reage ao excedente de PV com base nos valores configuráveis de consumo e geração da casa. Inclui migração para instalações existentes. Consistência do sistema e registro interno aprimorados.",
         "nl": "Volledige fotovoltaïsche besturing toegevoegd met automatische pompbesturing (modus 'Automatik (PV)'). De adapter reageert nu op PV-overschot op basis van configureerbare huisverbruik- en opwekkingswaarden. Migratie voor bestaande installaties inbegrepen. Verbeterde systeemconsistentie en interne logboekregistratie.",
         "fr": "Ajout du contrôle photovoltaïque complet avec gestion automatique de la pompe (mode 'Automatik (PV)'). L'adaptateur réagit désormais au surplus photovoltaïque en fonction des valeurs configurables de consommation et de production domestiques. Migration incluse pour les installations existantes. Cohérence du système et journalisation interne améliorées.",
         "it": "Aggiunto controllo fotovoltaico completo con gestione automatica della pompa (modalità 'Automatik (PV)'). L'adattatore ora reagisce al surplus fotovoltaico in base ai valori configurabili di consumo e generazione domestici. Migrazione inclusa per le installazioni esistenti. Migliorata la coerenza del sistema e la registrazione interna.",
         "es": "Se añadió control fotovoltaico completo con gestión automática de la bomba (modo 'Automatik (PV)'). El adaptador ahora reacciona al excedente fotovoltaico según los valores configurables de consumo y generación de la casa. Incluye migración para instalaciones existentes. Mejorada la coherencia del sistema y el registro interno.",
         "pl": "Dodano pełną kontrolę fotowoltaiczną z automatycznym zarządzaniem pompą (tryb 'Automatik (PV)'). Adapter reaguje teraz na nadwyżkę PV w oparciu o konfigurowalne wartości zużycia i produkcji energii. Zawiera migrację dla istniejących instalacji. Poprawiono spójność systemu i wewnętrzne logowanie.",
         "uk": "Додано повний фотогальванічний контроль з автоматичним керуванням насосом (режим 'Automatik (PV)'). Адаптер тепер реагує на надлишок PV на основі налаштовуваних значень споживання та генерації. Включено міграцію для існуючих установок. Покращено системну узгодженість і внутрішнє журналювання.",
         "zh-cn": "新增完整的光伏控制与自动泵管理（模式“Automatik (PV)”）。适配器现在可根据可配置的家庭耗电与发电数值响应光伏盈余。包含对现有安装的迁移。改进了系统一致性和内部日志记录。"
       }
	},
    "titleLang": {
      "en": "PoolControl",
      "de": "PoolControl",
      "ru": "PoolControl",
      "pt": "PoolControl",
      "nl": "PoolControl",
      "fr": "PoolControl",
      "it": "PoolControl",
      "es": "PoolControl",
      "pl": "PoolControl",
      "uk": "PoolControl",
      "zh-cn": "PoolControl"
    },
    "desc": {
      "en": "Adapter for controlling and monitoring pool systems (pump, temperature, solar, consumption, speech output).",
      "de": "Adapter zur Steuerung und Überwachung von Poolanlagen (Pumpe, Temperatur, Solar, Verbrauch, Sprachausgaben).",
      "ru": "Адаптер для управления и мониторинга бассейнов (насос, температура, солнечная система, потребление, голосовые оповещения).",
      "pt": "Adaptador para controlar e monitorar sistemas de piscina (bomba, temperatura, solar, consumo, saída de voz).",
      "nl": "Adapter voor het besturen en bewaken van zwembadsystemen (pomp, temperatuur, zonne-energie, verbruik, spraakuitvoer).",
      "fr": "Adaptateur pour contrôler et surveiller les systèmes de piscine (pompe, température, solaire, consommation, sorties vocales).",
      "it": "Adattatore per il controllo e il monitoraggio dei sistemi della piscina (pompa, temperatura, solare, consumo, uscite vocali).",
      "es": "Adaptador para controlar y supervisar sistemas de piscina (bomba, temperatura, solar, consumo, salida de voz).",
      "pl": "Adapter do sterowania i monitorowania systemów basenowych (pompa, temperatura, solar, zużycie, komunikaty głosowe).",
      "uk": "Адаптер для керування та моніторингу басейнових систем (насос, температура, сонячна енергія, споживання, голосові повідомлення).",
      "zh-cn": "用于控制和监控泳池系统的适配器（泵、温度、太阳能、能耗、语音输出）。"
    },
    "authors": [
      "DasBo1975 <dasbo1975@outlook.de>"
    ],
    "keywords": [
      "pool",
      "pumpe",
      "solar",
      "wasser",
      "temperatur"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "poolcontrol.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/DasBo1975/ioBroker.poolcontrol/main/admin/poolcontrol.png",
    "readme": "https://github.com/DasBo1975/ioBroker.poolcontrol/blob/main/README.md",
    "loglevel": "info",
    "ignoreLogs": [
      "State .*speech\\.solar_active.* has no existing object",
      "State .*speech\\.frost_active.* has no existing object",
      "State .*speech\\.time_active.* has no existing object"
    ],
    "tier": 3,
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
	"globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "option1": true,
    "option2": "42"
  },
  "objects": [],
  "instanceObjects": []
}

